PRELUDE  -*- mode: org; fill-column: 82 -*-
#+CATEGORY: prelude
#+STARTUP: content
#+seq_todo: TODO STARTED(s/@) WAITING(w@/@) DELEGATED(l@/@) APPT | DONE(d@/@) DEFERRED(f@/@) CANCELLED(x@/@) IDEA(i/@)
#+TAGS: { SCHOOL(s) BLOG(b) TIL(t) }
#+PROPERTY: Effort_ALL 0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00
#+COLUMNS: %30ITEM(Task) %CLOCKSUM %15Effort(Effort){:}

** DONE Move tables.rkt out of prelude
CLOSED: [2019-06-23 Sun 12:52] SCHEDULED: <2019-06-23 Sun>
- State "DONE"       from "STARTED"    [2019-06-23 Sun 12:52] \\
  Tables now live in their own multi package and collection.
:LOGBOOK:
CLOCK: [2019-06-23 Sun 12:27]--[2019-06-23 Sun 12:52] =>  0:25
:END:

we'd like to have #lang racket/tables so tables.rkt should probably be in its own
package and we'd want to require and re-export it from racket/racket collection?
Ditto prelude if I have to.

** DONE Move undefined aware logic ops from prelude to tables.rkt
CLOSED: [2019-06-23 Sun 12:17] SCHEDULED: <2019-06-23 Sun>
- State "DONE"       from "STARTED"    [2019-06-23 Sun 12:17] \\
  Prelude doesn't really depend on undefined aware logic, so we broke the loading
  cycle. Logic ops now live in the 'logic submod in tables.rkt
- State "TODO"       from "STARTED"    [2019-06-23 Sun 12:07] \\
  I moved logic combinators to a separate logic.rkt for now to avoid cycle in
  loading. Ideally I want logic to be a submodule of tables.rkt probably.
:LOGBOOK:
CLOCK: [2019-06-23 Sun 12:11]--[2019-06-23 Sun 12:17] =>  0:06
CLOCK: [2019-06-23 Sun 11:22]--[2019-06-23 Sun 12:07] =>  0:45
:END:

